#+title:     monad-oxide
#+author:    Logan Barnett-Hoy
#+email:     logustus@gmail.com
#+date:      <2022-07-13 Wed>
#+language:  en
#+file_tags:
#+tags:
#+auto_id:   t

*** map
:PROPERTIES:
:CUSTOM_ID: examples--result--map
:END:

Changing the inner value with =map=:
#+begin_src ruby :results value :exports both
require 'monad-oxide'

MonadOxide.ok('test')
  .map(->(s) { s.upcase() })
  .unwrap() # 'TEST'
#+end_src

#+RESULTS:
: TEST

Changing the =Result= type based on input:
#+begin_src ruby :exports both
require 'monad-oxide'

MonadOxide.ok('test')
  .and_then(->(s) {
    if s =~ /e/
      MonadOxide.err(ArgumentError.new("Can't have 'e' in test data."))
    else
      MonadOxide.ok(s.upcase())
    end
  })
  .unwrap_err() # The above ArgumentError.
#+end_src

#+RESULTS:
: #<ArgumentError: Can't have 'e' in test data.>

*** inspect
:PROPERTIES:
:CUSTOM_ID: examples--result--inspect
:END:

Inspecting a value in the chain without changing it:
#+begin_src ruby :exports both
require 'logger'
require 'monad-oxide'

logger = Logger.new(STDERR)
MonadOxide.ok('test')
  .and_then(->(s) {
    if s =~ /e/
      MonadOxide.err(ArgumentError.new("Can't have 'e' in test data."))
    else
      MonadOxide.ok(s.upcase())
    end
  })
  .inspect_err(logger.method(:error)) # Print any errors to the error log.
  .inspect_ok(logger.method(:info)) # Print any non-errors to the info log.
  .unwrap_err() # The above ArgumentError.
#+end_src

#+RESULTS:
: #<ArgumentError: Can't have 'e' in test data.>
**** unwrap and unwrap_err
:PROPERTIES:
:CUSTOM_ID: examples--result--unwrapping--unwrap-and-unwrap_err
:END:

=unwrap= and =unwrap_err= both access inner =Ok= and =Err= data, respectively.
If the =Result= is mismatched (=unwrap= with =Err= or =unwrap_err= with =Ok=),
an =MonadOxide::UnwrapError= is raised.

It is recommended to only use this for debugging purposes and instead seek
better, more functional uses in =Result= to work with the data in the =Result=.

=Ok= with =unwrap= just gets the data.

#+begin_src ruby :results value :exports both
require 'monad-oxide'

MonadOxide.ok('foo').unwrap()
#+end_src

#+RESULTS:
: foo

=Err= with =unwrap= raises =UnwrapError=:

#+begin_src ruby :results value :exports both
require 'monad-oxide'

begin
  MonadOxide.err('foo').unwrap()
rescue => e
  e.inspect()
end
#+end_src

#+RESULTS:
: #<MonadOxide::UnwrapError: MonadOxide::Err with "foo" could not be unwrapped as an Ok.>

=Ok= with =unwrap_err= raises =UnwrapError=:

#+begin_src ruby :results value :exports both
require 'monad-oxide'

begin
  MonadOxide.ok('foo').unwrap_err()
rescue => e
  e.inspect()
end
#+end_src

#+RESULTS:
: #<MonadOxide::UnwrapError: MonadOxide::Ok with "foo" could not be unwrapped as an Err.>

=Err= with =unwrap_err= just gets the data.

#+begin_src ruby :results value :exports both
require 'monad-oxide'

MonadOxide.err('foo').unwrap_err()
#+end_src

#+RESULTS:
: foo

*** arrays
:PROPERTIES:
:CUSTOM_ID: examples--result--arrays
:END:

You can use =#into_result= to convert an =Array= of =Results= to =Result= of an
=Array=.

#+begin_src ruby :results value verbatim :exports both
require 'monad-oxide'

[
  MonadOxide.ok('foo'),
  MonadOxide.ok('bar'),
]
  .into_result()
  .unwrap()
#+end_src

#+RESULTS:
: ["foo", "bar"]

=#into_result= will provide an =Err= if any of the elements in the =Array= are
=Err=.

#+begin_src ruby :results value verbatim :exports both
require 'monad-oxide'

[
  MonadOxide.ok('foo'),
  MonadOxide.err('bar'),
  MonadOxide.ok('baz'),
  MonadOxide.err('qux'),
]
  .into_result()
  .unwrap_err()
#+end_src

#+RESULTS:
: ["bar", "qux"]

*** try
:PROPERTIES:
:CUSTOM_ID: examples--result--try
:END:

~try~ is a way of taking some arbitrary code and converting the returned value
into a ~Ok~ or the raised error as an ~Err~.  This is for convenience to get you
started in a ~Result~ chain without an artificial
~MonadOxide.ok(nil).and_then(...)~.

The positive case:

#+begin_src ruby :results value verbatim :exports both
require 'monad-oxide'

r = MonadOxide::Result.try(->() {
  return 1
})
r.unwrap()
#+end_src

#+RESULTS:
: 1

#+begin_src ruby :results value verbatim :exports both
require 'monad-oxide'

r = MonadOxide::Result.try(->() {
  raise StandardError.new('bar')
})
r.unwrap_err()
#+end_src

#+RESULTS:
: #<StandardError: bar>

**** unwrap and unwrap_none
:PROPERTIES:
:CUSTOM_ID: examples--option--unwrapping--unwrap-and-unwrap_none
:END:

~unwrap~ and ~unwrap_none~ both access inner ~Some~ and ~None~ data,
respectively. If the ~Option~ is mismatched (~unwrap~ with ~None~ or
~unwrap_none~ with ~Some~), a ~MonadOxide::UnwrapError~ is raised.

It is recommended to only use this for debugging purposes.

~Some~ with ~unwrap~ just gets the data.

#+begin_src ruby :results value :exports both
require 'monad-oxide'

MonadOxide.some('foo').unwrap()
#+end_src

#+RESULTS:
: foo

~None~ with ~unwrap~ raises ~UnwrapError~:

#+begin_src ruby :results value :exports both
require 'monad-oxide'

begin
  MonadOxide.none().unwrap()
rescue => e
  e.inspect()
end
#+end_src

#+RESULTS:
: #<MonadOxide::UnwrapError: MonadOxide::None could not be unwrapped as a Some.>

~Some~ with ~unwrap_none~ raises ~UnwrapError~:

#+begin_src ruby :results value :exports both
require 'monad-oxide'

begin
  MonadOxide.some('foo').unwrap_none()
rescue => e
  e.inspect()
end
#+end_src

#+RESULTS:
: #<MonadOxide::UnwrapError: MonadOxide::Some with "foo" could not be unwrapped as a\nNone.\n>

~None~ with ~unwrap_none~ returns nil.

#+begin_src ruby :results value :exports both
require 'monad-oxide'

MonadOxide.none().unwrap_none()
#+end_src

#+RESULTS:
: 

